tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "sass/sass"
tap "shivammathur/php"
tap homebrew/cask-fonts

# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@14"
# Terminal multiplexer
brew "tmux"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Golang
brew "go"
# Git
brew "git"
# Bat
brew "bat"
# Eza
brew "eza"
# better grep
brew "ripgrep"
# better cd
brew "zoxide"
# Dependency manager for Cocoa projects
brew "cocoapods"

# Install zsh stuff
brew "font-hack-nerd-font"
brew "zsh"
brew install "zsh-autosuggestions"
brew install "zsh-syntax-highlighting"
brew install "oh-my-posh"

cask "raycast"
cask "brave-browser"
cask "stats"
cask "discord"
cask "rectangle"
cask "alacritty"
cask "spotify"
